Repository: fluxer/kde-playground
Catalog: redshift-plasmoid/po/*.po
Languages: es

# KDE Plasma activity. Title Capitalization.
source: Activity
es: Actividad

# Redshift operation mode. Title Capitalization.
source: Mode
es: Modo

# Sentence capitalization.
source: Latitude:
es: Latitud:

# Sentence capitalization.
source: Longitude:
es: Longitud:

# The desired color temperature during the day. Sentence capitalization.
source: Day color temperature:
es: Temperatura de color diurna:

# The desired color temperature during the night. Sentence capitalization.
source: Night color temperature:
es: Temperatura de color nocturna:

source: Additional gamma correction (Default is 1:1:1).
es: Corrección de gama adicional (por omisión 1:1:1).

# The screen gamma channels, red, green, blue. Sentence capitalization.
source: Gamma (RGB):
es: Gama (RGB):

source: Smooth transition:
es: Transición suave:

# Launch the program on startup. Sentence capitalization.
source: Autostart:
es: Autoinicio:

# Sentence capitalization.
source: Enabled
es: Habilitado

# The method used to set the color temperature. Sentence capitalization.
source: Adjust method:
es: Método de ajuste:

# Sentence capitalization.
source: Brightness:
es: Brillo:

# @label - KCFG entry name
source: Latitude
es: Latitud

# @label- KCFG entry name
source: Longitude
es: Longitud

# @label - KCFG entry name
source: Day color temperature
es: Temperatura de color diurna

# @info:tooltip
source: A neutral color temperature is 6500 K.
es: 6500 K es una temperatura de color neutral.

# @label - KCFG entry name
source: Night color temperature
es: Temperatura de color nocturna

# @info:tooltip
source: The recommended night color temperature is 4500 K.
es: 4500 K es la temperatura de color nocturna recomendada.

# @label - KCFG entry name
source: Red gamma correction
es: Corrección de gama rojo

# @info:tooltip
source: Gamma correction (Red)
es: Corrección gama (Rojo)

# @label - KCFG entry name
source: Green gamma correction
es: Corrección de gama verde

# @info:tooltip
source: Gamma correction (Green)
es: Corrección gama (Verde)

# @label - KCFG entry name
source: Blue gamma correction
es: Corrección de gama azul

# @info:tooltip
source: Gamma correction (Blue)
es: Corrección gama (Azul)

# @label - KCFG entry name
source: Brightness
es: Brillo

# @label - KCFG entry name
source: Smooth transition flag
es: Marca de transición suave

# @label - KCFG entry name
source: Autostart flag
es: Marca de autoinicio

# @label - KCFG entry name
source: Color adjustment method
es: Método de ajuste de color

# @info:tooltip
source: Redshift color adjustment method. If «Auto» («randr») doesn't work, try «vidmode».
es: Método de ajuste de color. Si «Auto» («randr») no funciona, tratar «vidmode».

source: Always on activities
es: Siempre habilitado en actividades

source: Always off activities
es: Siempre deshabilitado en actividades

# NAME OF TRANSLATORS
source: Your names
es: ThecaTTony

# EMAIL OF TRANSLATORS
source: Your emails
es: thecattony@gmx.com

# Action the user can perform
source: Click to toggle on. Scroll the mouse wheel to set the color temperature manually.
es: Click para habilitar. Girar la rueda del mouse para establecer la temperatura de color manualmente.

# Action the user can perform
source: Click to toggle off. Scroll the mouse wheel to set the color temperature manually.
es: Click para deshabilitar. Girar la rueda del mouse para establecer la temperatura de color manualmente.

# Action the user can perform
source: Click to switch to auto mode. Scroll the mouse wheel to change the color temperature.
es: Click pasar cambiar a modo Auto. Girar la rueda del mouse para establecer la temperatura de color manualmente.

# Redshift is forced to be enabled in this activity. Title Capitalization.
source: Always Enabled
es: Siempre Habilitado

# Redshift is forced to be disabled in this activity. Title Capitalization.
source: Always Disabled
es: Siempre Deshabilitado

# Redshift activities behaviour configuration page. Title Capitalization.
source: Activities
es: Actividades
